IDENTIFICATION DIVISION.
PROGRAM-ID. NUMBERS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A        PIC 9 VALUE 0.
01 B        PIC 9 VALUE 0.
01 RESULT   PIC 9 VALUE 0.

PROCEDURE DIVISION.

ADD-NUMBERS.
    ADD A TO B GIVING RESULT
    EXIT.
